---
type: FabricationConnectorInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# FabricationConnectorInfo

`Autodesk.Revit.DB.FabricationConnectorInfo` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | HasDoubleWallConnector | 2016 | `public bool HasDoubleWallConnector ()` |
| Method | IsValid | 2016 | `public bool IsValid ()` |
| Property | BodyConnectorId | 2016 | `public int BodyConnectorId { get ; set ; }` |
| Property | DoubleWallConnectorId | 2016 | `public int DoubleWallConnectorId { get ; set ; }` |
| Property | FabricationIndex | 2016 | `public int FabricationIndex { get ; }` |
| Property | IsBodyConnectorLocked | 2016 | `public bool IsBodyConnectorLocked { get ; set ; }` |
| Property | IsDoubleWallConnectorLocked | 2016 | `public bool IsDoubleWallConnectorLocked { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |